export interface Product {
  id: number;
  name: { ru: string; kz: string };
  price: string;
  previewImage: string;
  images: string[];
  description: { ru: string; kz: string };
  batteryCapacity: { ru: string; kz: string };
  volume: { ru: string; kz: string };
  maxDistance: { ru: string; kz: string };
  specs: Array<{
    label: { ru: string; kz: string };
    items: Array<{
      param: { ru: string; kz: string };
      value: { ru: string; kz: string };
    }>;
  }>;
}

export const products: { drones: Product[]; vacuums: Product[] } = {
  drones: [
    {
      id: 0,
      name: {
        ru: "XAG P100 Pro",
        kz: "XAG P100 Pro",
      },
      price: "11 160 000 ₸",
      previewImage: "/images/products/drones/P100/p100Preview.png",
      images: [
        "/images/products/drones/P100/p100-1.png",
        "/images/products/drones/P100/p100-2.png",
        "/images/products/drones/P100/p100-3.png",
        "/images/products/drones/P100/p100-4.png",
        "/images/products/drones/P100/p100-5.png",
        "/images/products/drones/P100/p100-6.png",
        "https://www.youtube.com/embed/Z-KZpplnkWg?si=8BaTC5_j39cV0PQd",
      ],
      description: {
        ru: "XAG P100 Pro — передовой агродрон с улучшенной системой опрыскивания RevoSpray 3 и разбрасывания RevoCast 3. Обладает защитой IPX6K, поддерживает RTK-навигацию, 4D-радар, камеру обзора и высокую мощность моторов. Предназначен для высокоточной обработки сельскохозяйственных культур в автономном и ручном режимах.",
        kz: "XAG P100 Pro — озық RevoSpray 3 бүрку жүйесі мен RevoCast 3 шашу жүйесімен жабдықталған агродрон. IPX6K қорғанысымен, RTK-навигацияны, 4D-радардың, шолу камерасын және күшті қозғалтқышты қолдайды. Автономды және қолмен режимде ауыл шаруашылығы дақылдарын жоғары дәлдікпен өңдеуге арналған.",
      },
      volume: { ru: "50 л", kz: "50 л" },
      batteryCapacity: { ru: "962 Вт⋅ч", kz: "962 Вт⋅сағ" },
      maxDistance: { ru: "2000 м", kz: "2000 м" },
      specs: [
        {
          label: { ru: "Основные характеристики", kz: "Негізгі сипаттамалар" },
          items: [
            {
              param: { ru: "Размеры", kz: "Өлшемдері" },
              value: {
                ru: "2927 × 2868 × 323 мм (в разложенном виде); 893 × 1095 × 345 мм (в сложенном виде)",
                kz: "2927 × 2868 × 323 мм (ашық күйде); 893 × 1095 × 345 мм (қоршаулы күйде)",
              },
            },
            {
              param: { ru: "Диагональ моторов", kz: "Қозғалтқыш диагоналі" },
              value: { ru: "2094 мм", kz: "2094 мм" },
            },
            {
              param: { ru: "Вес", kz: "Салмақ" },
              value: {
                ru: "46 кг (без полезной нагрузки, с батареей)",
                kz: "46 кг (пайдалы жүктеме жоқ, батареямен)",
              },
            },
            {
              param: { ru: "Класс защиты", kz: "Қорғаныс класы" },
              value: { ru: "IPX6K", kz: "IPX6K" },
            },
            {
              param: { ru: "Материал корпуса", kz: "Корпус материалы" },
              value: {
                ru: "Стекловолокно и углеродное волокно",
                kz: "Шыны талшық және көміртекті талшық",
              },
            },
            {
              param: { ru: "Макс. взлётный вес", kz: "Макс. ұшу салмағы" },
              value: { ru: "до 96 кг", kz: "96 кг дейін" },
            },
            {
              param: {
                ru: "Рекомендуемая температура эксплуатации",
                kz: "Ұсынылатын пайдалану температурасы",
              },
              value: { ru: "0 ~ 40 ℃", kz: "0 ~ 40 ℃" },
            },
          ],
        },
        {
          label: {
            ru: "Система распыления RevoSpray 3",
            kz: "RevoSpray 3 бүрку жүйесі",
          },
          items: [
            {
              param: { ru: "Размер модуля", kz: "Модуль өлшемі" },
              value: { ru: "737 × 734 × 497 мм", kz: "737 × 734 × 497 мм" },
            },
            {
              param: { ru: "Ёмкость бака", kz: "Бак сыйымдылығы" },
              value: { ru: "50 л", kz: "50 л" },
            },
            {
              param: { ru: "Количество форсунок", kz: "Саптамалар саны" },
              value: { ru: "2", kz: "2" },
            },
            {
              param: { ru: "Скорость дисков", kz: "Дискілер жылдамдығы" },
              value: { ru: "1000–16000 об/мин", kz: "1000–16000 айн/мин" },
            },
            {
              param: { ru: "Размер капель", kz: "Тынысқан тамшылар мөлшері" },
              value: { ru: "60–400 мкм", kz: "60–400 мкм" },
            },
            {
              param: { ru: "Ширина распыления", kz: "Бүрку ені" },
              value: { ru: "5–10 м", kz: "5–10 м" },
            },
            {
              param: {
                ru: "Макс. расход жидкости",
                kz: "Макс. сұйықтық тұтыну",
              },
              value: { ru: "22 л/мин", kz: "22 л/мин" },
            },
            {
              param: { ru: "Насос", kz: "Сорғы" },
              value: {
                ru: "Две перистальтические помпы, до 11 л/мин каждая",
                kz: "Екі перистальтикалық помпа, әрқайсысы 11 л/мин дейін",
              },
            },
          ],
        },
        {
          label: {
            ru: "Система разбрасывания RevoCast 3",
            kz: "RevoCast 3 шашу жүйесі",
          },
          items: [
            {
              param: { ru: "Размер модуля", kz: "Модуль өлшемі" },
              value: { ru: "1059 × 728 × 651 мм", kz: "1059 × 728 × 651 мм" },
            },
            {
              param: { ru: "Объём бункера", kz: "Бункер көлемі" },
              value: { ru: "80 л", kz: "80 л" },
            },
            {
              param: { ru: "Максимальная нагрузка", kz: "Макс. жүктеме" },
              value: { ru: "50 кг", kz: "50 кг" },
            },
            {
              param: {
                ru: "Макс. скорость разбрасывания",
                kz: "Макс. шашу жылдамдығы",
              },
              value: { ru: "150 кг/мин", kz: "150 кг/мин" },
            },
            {
              param: { ru: "Размер гранул", kz: "Гранул мөлшері" },
              value: { ru: "1–6 мм", kz: "1–6 мм" },
            },
            {
              param: { ru: "Ширина разбрасывания", kz: "Шашу ені" },
              value: { ru: "3–7 м", kz: "3–7 м" },
            },
          ],
        },
        {
          label: { ru: "Полётные характеристики", kz: "Ұшу сипаттамалары" },
          items: [
            {
              param: {
                ru: "Макс. скорость полета",
                kz: "Макс. ұшу жылдамдығы",
              },
              value: { ru: "13.8 м/с", kz: "13.8 м/с" },
            },
            {
              param: {
                ru: "Макс. расстояние полета",
                kz: "Макс. ұшу қашықтығы",
              },
              value: { ru: "2000 м", kz: "2000 м" },
            },
            {
              param: {
                ru: "Точность зависания (RTK)",
                kz: "Тұру дәлдігі (RTK)",
              },
              value: {
                ru: "±10 см по горизонтали и вертикали",
                kz: "±10 см көлденең және тігінен",
              },
            },
            {
              param: { ru: "Без RTK", kz: "RTK жоқ" },
              value: {
                ru: "±0.6 м (горизонталь), ±0.3 м (вертикаль)",
                kz: "±0.6 м (көлденең), ±0.3 м (тікелей)",
              },
            },
          ],
        },
        {
          label: {
            ru: "Система обнаружения и навигации",
            kz: "Анықтау және навигация жүйесі",
          },
          items: [
            {
              param: { ru: "Радар", kz: "Радар" },
              value: {
                ru: "4D Imaging Radar, до 80 м, угол обзора ±40°",
                kz: "4D бейнелеу радары, 80 м дейін, көріну бұрышы ±40°",
              },
            },
            {
              param: { ru: "Камера PSL", kz: "PSL камерасы" },
              value: {
                ru: "1920×1080, 30 fps, угол 3.2 мм",
                kz: "1920×1080, 30 fps, 3.2 мм бұрыш",
              },
            },
            {
              param: { ru: "Навигация", kz: "Навигация" },
              value: {
                ru: "RTK + GNSS, высокая точность",
                kz: "RTK + GNSS, жоғары дәлдік",
              },
            },
            {
              param: { ru: "Контроллер", kz: "Контроллер" },
              value: { ru: "SuperX 4 Pro", kz: "SuperX 4 Pro" },
            },
          ],
        },
        {
          label: { ru: "Питание и зарядка", kz: "Қуат және зарядтау" },
          items: [
            {
              param: { ru: "Батарея", kz: "Батарея" },
              value: {
                ru: "B13960S, 962 Вт⋅ч, 48.1 В/120 А",
                kz: "B13960S, 962 Вт⋅сағ, 48.1 В/120 А",
              },
            },
            {
              param: { ru: "Зарядка", kz: "Зарядтау" },
              value: {
                ru: "CM13600, до 3400 Вт, 56.6 В/80 А",
                kz: "CM13600, 3400 Вт дейін, 56.6 В/80 А",
              },
            },
            {
              param: { ru: "Станция", kz: "Станция" },
              value: {
                ru: "GC4000+, мощность до 5.1 кВт, объём бака 15 л",
                kz: "GC4000+, 5.1 кВт дейін қуат, бак көлемі 15 л",
              },
            },
          ],
        },
        {
          label: { ru: "Управление", kz: "Басқару" },
          items: [
            {
              param: { ru: "Пульт", kz: "Пульт" },
              value: {
                ru: "XAG ARC3 Pro, до 1 км, 6 часов работы",
                kz: "XAG ARC3 Pro, 1 км дейін, 6 сағат жұмыс",
              },
            },
            {
              param: { ru: "Контроллер ACS2", kz: "ACS2 контроллері" },
              value: {
                ru: "До 800 м, совместим с P100 Pro",
                kz: "800 м дейін, P100 Pro-пен үйлесімді",
              },
            },
          ],
        },
      ],
    },
  ],
  vacuums: [
    {
      id: 0,
      name: { ru: "Phantas", kz: "Phantas" },
      price: "7 613 000 ₸",
      previewImage: "/images/products/vacuums/Phantas/phantasPreview.avif",
      images: [
        "/images/products/vacuums/Phantas/phantasPreview.avif",
        "https://www.youtube.com/embed/AHrLejWi9ho?si=w8KklnoIQk1srnp4",
      ],
      description: {
        ru: "Phantas — универсальный робот-пылесос с несколькими режимами уборки, включая сухую, влажную и пылесос. Оснащён интеллектуальными сенсорами.",
        kz: "Phantas — әмбебап робот-шаңсорғыш, құрғақ, ылғалды және шаңсорғыш режимдерін қолдайды. Ақылды сенсорлармен жабдықталған.",
      },
      batteryCapacity: { ru: "до 14 ч", kz: "14 сағатқа дейін" },
      volume: { ru: "6 л", kz: "6 л" },
      maxDistance: { ru: "410 мм", kz: "410 мм" },
      specs: [
        {
          label: { ru: "Габариты и масса", kz: "Өлшемдері және салмақ" },
          items: [
            {
              param: { ru: "Длина", kz: "Ұзындығы" },
              value: { ru: "540 мм", kz: "540 мм" },
            },
            {
              param: { ru: "Ширина", kz: "Ені" },
              value: { ru: "440 мм", kz: "440 мм" },
            },
            {
              param: { ru: "Высота", kz: "Биіктігі" },
              value: { ru: "617 мм", kz: "617 мм" },
            },
            {
              param: { ru: "Вес", kz: "Салмақ" },
              value: { ru: "48 кг", kz: "48 кг" },
            },
          ],
        },
        {
          label: { ru: "Уборка", kz: "Тазалау" },
          items: [
            {
              param: { ru: "Ширина пылесоса", kz: "Шаңсорғыш ені" },
              value: { ru: "410 мм", kz: "410 мм" },
            },
            {
              param: { ru: "Ширина мытья пола", kz: "Еден жуу ені" },
              value: { ru: "330 мм", kz: "330 мм" },
            },
            {
              param: { ru: "Макс. эффективность", kz: "Макс. тиімділік" },
              value: { ru: "1180 ㎡/ч", kz: "1180 ㎡/сағ" },
            },
            {
              param: {
                ru: "Практическая эффективность",
                kz: "Практикалық тиімділік",
              },
              value: { ru: "350–700 ㎡/ч", kz: "350–700 ㎡/сағ" },
            },
            {
              param: {
                ru: "Объём баков (чистая/грязная вода)",
                kz: "Бак көлемі (таза/ластанған су)",
              },
              value: { ru: "11.5 / 10.5 л", kz: "11.5 / 10.5 л" },
            },
            {
              param: { ru: "Мешок для пыли", kz: "Шаң қапшығы" },
              value: { ru: "6 л", kz: "6 л" },
            },
            {
              param: { ru: "Контейнер для мусора", kz: "Қоқыс контейнері" },
              value: { ru: "0.7 л", kz: "0.7 л" },
            },
          ],
        },
        {
          label: { ru: "Передвижение", kz: "Қозғалыс" },
          items: [
            {
              param: { ru: "Преодоление уклонов", kz: "Үзінділерді еңсеру" },
              value: { ru: "8°", kz: "8°" },
            },
            {
              param: { ru: "Макс. скорость", kz: "Макс. жылдамдық" },
              value: { ru: "0.8 м/с", kz: "0.8 м/с" },
            },
            {
              param: { ru: "Мин. проходимая ширина", kz: "Мин. өту ені" },
              value: { ru: "600 мм", kz: "600 мм" },
            },
          ],
        },
        {
          label: { ru: "Питание", kz: "Қуат" },
          items: [
            {
              param: { ru: "Макс. время работы", kz: "Макс. жұмыс уақыты" },
              value: {
                ru: "до 14 ч (в зависимости от режима)",
                kz: "14 сағатқа дейін (режимге байланысты)",
              },
            },
            {
              param: { ru: "Время зарядки", kz: "Зарядтау уақыты" },
              value: { ru: "≈ 2 ч", kz: "≈ 2 сағ" },
            },
          ],
        },
        {
          label: { ru: "Сенсоры", kz: "Сенсорлар" },
          items: [
            {
              param: { ru: "Сенсоры", kz: "Сенсорлар" },
              value: {
                ru: "2D LiDAR, 3D камера, RGB, анти-падение, анти-столкновение",
                kz: "2D LiDAR, 3D камера, RGB, құлау алдын-алу, соқтығысу алдын-алу",
              },
            },
          ],
        },
      ],
    },
    {
      id: 1,
      name: { ru: "Scrubber 50", kz: "Scrubber 50" },
      price: "21 263 000 ₸",
      previewImage: "/images/products/vacuums/Scrubber50/scrubber50Preview.png",
      images: [
        "/images/products/vacuums/Scrubber50/Scrubber50-1.png",
        "/images/products/vacuums/Scrubber50/Scrubber50-2.png",
        "/images/products/vacuums/Scrubber50/Scrubber50-3.png",
        "/images/products/vacuums/Scrubber50/Scrubber50-4.png",
        "/images/products/vacuums/Scrubber50/Scrubber50-5.png",
        "https://www.youtube.com/embed/2LvFVi1FNSo?si=Rj8go829CsPpJhXt",
      ],
      description: {
        ru: "Scrubber 50 — многофункциональный уборочный робот с возможностью выбора щёток. Подходит для различных типов полов.",
        kz: "Scrubber 50 — щеткаларды таңдау мүмкіндігі бар көпфункционалды тазалау роботы. Түрлі еден түрлеріне арналған.",
      },
      batteryCapacity: { ru: "до 8 ч", kz: "8 сағатқа дейін" },
      volume: { ru: "24 л", kz: "24 л" },
      maxDistance: { ru: "460 мм", kz: "460 мм" },
      specs: [
        {
          label: { ru: "Габариты и масса", kz: "Өлшемдері және салмақ" },
          items: [
            {
              param: { ru: "Длина", kz: "Ұзындығы" },
              value: { ru: "810 мм", kz: "810 мм" },
            },
            {
              param: { ru: "Ширина", kz: "Ені" },
              value: { ru: "700 мм", kz: "700 мм" },
            },
            {
              param: { ru: "Высота", kz: "Биіктігі" },
              value: { ru: "1070 мм", kz: "1070 мм" },
            },
            {
              param: { ru: "Вес", kz: "Салмақ" },
              value: {
                ru: "157 кг (диск), 148 кг (ролик)",
                kz: "157 кг (диск), 148 кг (ролик)",
              },
            },
          ],
        },
        {
          label: { ru: "Уборка", kz: "Тазалау" },
          items: [
            {
              param: { ru: "Ширина чистки", kz: "Тазалау ені" },
              value: {
                ru: "460 мм (диск), 406 мм (ролик)",
                kz: "460 мм (диск), 406 мм (ролик)",
              },
            },
            {
              param: { ru: "Макс. эффективность", kz: "Макс. тиімділік" },
              value: {
                ru: "1987 ㎡/ч (диск), 1754 ㎡/ч (ролик)",
                kz: "1987 ㎡/сағ (диск), 1754 ㎡/сағ (ролик)",
              },
            },
            {
              param: {
                ru: "Практическая эффективность",
                kz: "Практикалық тиімділік",
              },
              value: { ru: "500–1300 ㎡/ч", kz: "500–1300 ㎡/сағ" },
            },
            {
              param: { ru: "Давление щётки", kz: "Шетка қысымы" },
              value: {
                ru: "25 кг (диск), 18 кг (ролик)",
                kz: "25 кг (диск), 18 кг (ролик)",
              },
            },
            {
              param: {
                ru: "Объём баков (чистая/грязная вода)",
                kz: "Бак көлемі (таза/ластанған су)",
              },
              value: { ru: "30 / 24 л", kz: "30 / 24 л" },
            },
          ],
        },
        {
          label: { ru: "Передвижение", kz: "Қозғалыс" },
          items: [
            {
              param: { ru: "Преодоление уклонов", kz: "Үзінділерді еңсеру" },
              value: { ru: "4.6°", kz: "4.6°" },
            },
            {
              param: { ru: "Макс. скорость", kz: "Макс. жылдамдық" },
              value: { ru: "1.2 м/с", kz: "1.2 м/с" },
            },
            {
              param: { ru: "Мин. ширина прохода", kz: "Мин. өту ені" },
              value: { ru: "800 мм", kz: "800 мм" },
            },
          ],
        },
        {
          label: { ru: "Питание", kz: "Қуат" },
          items: [
            {
              param: { ru: "Батарея", kz: "Батарея" },
              value: { ru: "60 А⋅ч, 24 В", kz: "60 А⋅сағ, 24 В" },
            },
            {
              param: { ru: "Время зарядки", kz: "Зарядтау уақыты" },
              value: { ru: "2 ч", kz: "2 сағ" },
            },
            {
              param: { ru: "Макс. время работы", kz: "Макс. жұмыс уақыты" },
              value: { ru: "до 8 ч", kz: "8 сағатқа дейін" },
            },
          ],
        },
        {
          label: { ru: "Сенсоры", kz: "Сенсорлар" },
          items: [
            {
              param: { ru: "Сенсоры", kz: "Сенсорлар" },
              value: {
                ru: "2D LiDAR, 3D камера, RGB, анти-столкновение",
                kz: "2D LiDAR, 3D камера, RGB, соқтығысу алдын-алу",
              },
            },
          ],
        },
      ],
    },
    {
      id: 2,
      name: { ru: "Scrubber 75", kz: "Scrubber 75" },
      price: "32 815 000 ₸",
      previewImage: "/images/products/vacuums/Scrubber75/scrubber75Preview.png",
      images: [
        "/images/products/vacuums/Scrubber75/Scrubber75-1.png",
        "/images/products/vacuums/Scrubber75/Scrubber75-2.png",
        "/images/products/vacuums/Scrubber75/Scrubber75-3.png",
        "/images/products/vacuums/Scrubber75/Scrubber75-4.png",
        "/images/products/vacuums/Scrubber75/Scrubber75-5.png",
        "https://www.youtube.com/embed/lAWBz7byrBs?si=zUyezDz2_AjQa_Qt",
      ],
      description: {
        ru: "Scrubber 75 — высокопроизводительный автономный поломоечный робот для уборки больших помещений.",
        kz: "Scrubber 75 — үлкен кеңістіктерді тазалау үшін жоғары өнімді автономды еден жуу роботы.",
      },
      batteryCapacity: { ru: "4–6 ч", kz: "4–6 сағ" },
      volume: { ru: "50 л", kz: "50 л" },
      maxDistance: { ru: "750 мм", kz: "750 мм" },
      specs: [
        {
          label: { ru: "Габариты и масса", kz: "Өлшемдері және салмақ" },
          items: [
            {
              param: { ru: "Длина", kz: "Ұзындығы" },
              value: { ru: "1370 мм", kz: "1370 мм" },
            },
            {
              param: { ru: "Ширина", kz: "Ені" },
              value: { ru: "962 мм", kz: "962 мм" },
            },
            {
              param: { ru: "Высота", kz: "Биіктігі" },
              value: { ru: "1417 мм", kz: "1417 мм" },
            },
            {
              param: { ru: "Вес", kz: "Салмақ" },
              value: { ru: "400 кг", kz: "400 кг" },
            },
          ],
        },
        {
          label: { ru: "Уборка", kz: "Тазалау" },
          items: [
            {
              param: { ru: "Ширина чистки", kz: "Тазалау ені" },
              value: { ru: "750 мм", kz: "750 мм" },
            },
            {
              param: { ru: "Макс. эффективность", kz: "Макс. тиімділік" },
              value: { ru: "3000 ㎡/ч", kz: "3000 ㎡/сағ" },
            },
            {
              param: {
                ru: "Практическая эффективность",
                kz: "Практикалық тиімділік",
              },
              value: { ru: "700–1400 ㎡/ч", kz: "700–1400 ㎡/сағ" },
            },
            {
              param: {
                ru: "Объём баков (чистая/грязная вода)",
                kz: "Бак көлемі (таза/ластанған су)",
              },
              value: { ru: "75 / 50 л", kz: "75 / 50 л" },
            },
          ],
        },
        {
          label: { ru: "Передвижение", kz: "Қозғалыс" },
          items: [
            {
              param: { ru: "Преодоление уклонов", kz: "Үзінділерді еңсеру" },
              value: {
                ru: "3° (уборка), 8° (движение)",
                kz: "3° (тазалау), 8° (қозғалыс)",
              },
            },
            {
              param: { ru: "Макс. скорость", kz: "Макс. жылдамдық" },
              value: { ru: "1.1 м/с", kz: "1.1 м/с" },
            },
            {
              param: { ru: "Мин. ширина прохода", kz: "Мин. өту ені" },
              value: { ru: "1400 мм", kz: "1400 мм" },
            },
          ],
        },
        {
          label: { ru: "Питание", kz: "Қуат" },
          items: [
            {
              param: { ru: "Батарея", kz: "Батарея" },
              value: { ru: "200 А⋅ч, 24 В", kz: "200 А⋅сағ, 24 В" },
            },
            {
              param: { ru: "Время зарядки", kz: "Зарядтау уақыты" },
              value: { ru: "≈ 5 ч", kz: "≈ 5 сағ" },
            },
            {
              param: { ru: "Время работы", kz: "Жұмыс уақыты" },
              value: { ru: "4–6 ч", kz: "4–6 сағ" },
            },
          ],
        },
        {
          label: { ru: "Сенсоры", kz: "Сенсорлар" },
          items: [
            {
              param: { ru: "Сенсоры", kz: "Сенсорлар" },
              value: {
                ru: "3D LiDAR, 2D LiDAR, 3D камера, анти-столкновение, анти-падение",
                kz: "3D LiDAR, 2D LiDAR, 3D камера, соқтығысу алдын-алу, құлау алдын-алу",
              },
            },
          ],
        },
      ],
    },
    {
      id: 3,
      name: { ru: "Vacuum 40", kz: "Vacuum 40" },
      price: "14 490 000 ₸",
      previewImage: "/images/products/vacuums/Vacuum40/vacuum40Preview.png",
      images: [
        "/images/products/vacuums/Vacuum40/Vacuum40-1.png",
        "/images/products/vacuums/Vacuum40/Vacuum40-2.png",
        "/images/products/vacuums/Vacuum40/Vacuum40-3.png",
        "/images/products/vacuums/Vacuum40/Vacuum40-4.png",
        "/images/products/vacuums/Vacuum40/Vacuum40-5.png",
        "https://www.youtube.com/embed/MP7TpIRtwTE?si=M3mLU5YFTXLClP1r",
      ],
      description: {
        ru: "Vacuum 40 — автономный пылесос для коммерческих помещений. Имеет вместительный мешок для пыли и высокую эффективность.",
        kz: "Vacuum 40 — коммерциялық алаңдарға арналған автономды шаңсорғыш. Кең шаң қапшығы және жоғары тиімділігі бар.",
      },
      batteryCapacity: { ru: "до 18 ч", kz: "18 сағатқа дейін" },
      volume: { ru: "12 л", kz: "12 л" },
      maxDistance: { ru: "720 мм", kz: "720 мм" },
      specs: [
        {
          label: { ru: "Габариты и масса", kz: "Өлшемдері және салмақ" },
          items: [
            {
              param: { ru: "Длина", kz: "Ұзындығы" },
              value: { ru: "800 мм", kz: "800 мм" },
            },
            {
              param: { ru: "Ширина", kz: "Ені" },
              value: { ru: "690 мм", kz: "690 мм" },
            },
            {
              param: { ru: "Высота", kz: "Биіктігі" },
              value: { ru: "890 мм", kz: "890 мм" },
            },
            {
              param: { ru: "Вес", kz: "Салмақ" },
              value: { ru: "91 кг", kz: "91 кг" },
            },
          ],
        },
        {
          label: { ru: "Уборка", kz: "Тазалау" },
          items: [
            {
              param: { ru: "Ширина уборки", kz: "Тазалау ені" },
              value: { ru: "720 мм", kz: "720 мм" },
            },
            {
              param: { ru: "Макс. эффективность", kz: "Макс. тиімділік" },
              value: { ru: "2300 ㎡/ч", kz: "2300 ㎡/сағ" },
            },
            {
              param: {
                ru: "Практическая эффективность",
                kz: "Практикалық тиімділік",
              },
              value: { ru: "400–800 ㎡/ч", kz: "400–800 ㎡/сағ" },
            },
            {
              param: { ru: "Макс. воздушный поток", kz: "Макс. ауа ағыны" },
              value: { ru: "120 м³/ч", kz: "120 м³/сағ" },
            },
            {
              param: { ru: "Пылесборник", kz: "Шаң жинағыш" },
              value: { ru: "12 л", kz: "12 л" },
            },
            {
              param: { ru: "Контейнер для мусора", kz: "Қоқыс контейнері" },
              value: { ru: "2.5 л", kz: "2.5 л" },
            },
            {
              param: {
                ru: "Макс. давление всасывания",
                kz: "Макс. сорылу қысымы",
              },
              value: { ru: "24 кПа", kz: "24 кПа" },
            },
          ],
        },
        {
          label: { ru: "Передвижение", kz: "Қозғалыс" },
          items: [
            {
              param: { ru: "Преодоление уклонов", kz: "Үзінділерді еңсеру" },
              value: { ru: "4° / 8°", kz: "4° / 8°" },
            },
            {
              param: { ru: "Макс. скорость", kz: "Макс. жылдамдық" },
              value: { ru: "0.9 м/с", kz: "0.9 м/с" },
            },
            {
              param: { ru: "Мин. радиус разворота", kz: "Мин. айналу радиусы" },
              value: { ru: "1100 мм", kz: "1100 мм" },
            },
          ],
        },
        {
          label: { ru: "Питание", kz: "Қуат" },
          items: [
            {
              param: { ru: "Батарея", kz: "Батарея" },
              value: { ru: "60 А⋅ч, 24 В", kz: "60 А⋅сағ, 24 В" },
            },
            {
              param: { ru: "Время зарядки", kz: "Зарядтау уақыты" },
              value: { ru: "≈ 2.5 ч", kz: "≈ 2.5 сағ" },
            },
            {
              param: { ru: "Макс. время работы", kz: "Макс. жұмыс уақыты" },
              value: { ru: "до 18 ч", kz: "18 сағатқа дейін" },
            },
          ],
        },
        {
          label: { ru: "Сенсоры", kz: "Сенсорлар" },
          items: [
            {
              param: { ru: "Сенсоры", kz: "Сенсорлар" },
              value: {
                ru: "LiDAR, 3D камера, анти-падение, датчик столкновений",
                kz: "LiDAR, 3D камера, құлау және соқтығысу сенсорлары",
              },
            },
          ],
        },
      ],
    },
  ],
};
